import java.util.Scanner;

public class NumberToSentence {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        System.out.print("Enter the number (-1,000,000/1,000,000): ");
        int number = scanner.nextInt();
        if (number > 1000000 || number < -1000000) {
            System.out.println("The number is out of range");
        }
        else {
            System.out.println(numberToSentence(number));
        }
    }

    public static String numberToSentence(int number) {
        String[] from_1_to_100 = {"ნული ", "ერთი ", "ორი ",
                "სამი ", "ოთხი ", "ხუთი ",
                "ექვსი ", "შვიდი ", "რვა ",
                "ცხრა ", "ათი ","თერთმეტი ",
                "თორმეტი ", "ცამეტი ", "თოთხმეტი ",
                "თხუთმეტი ", "თექვსმეტი ", "ჩვიდმეტი ",
                "თვრამეტი ", "ცხრამეტი ", "ოცი ",
                "ოცდაერთი ", "ოცდაორი ",
                "ოცდასამი ", "ოცდაოთხი ", "ოცდახუთი ",
                "ოცდაექვსი ", "ოცდაშვიდი ", "ოცდარვა ",
                "ოცდაცხრა ", "ოცდაათი ","ოცდათერთმეტი ",
                "ოცდათორმეტი ", "ოცდაცამეტი ", "ოცდათოთხმეტი ",
                "ოცდათხუთმეტი ", "ოცდათექვსმეტი ", "ოცდაჩვიდმეტი ",
                "ოცდათვრამეტი ", "ოცდაცხრამეტი ", "ორმოცი ",
                "ორმოცდაერთი ", "ორმოცდაორი ",
                "ორმოცდასამი ", "ორმოცდაოთხი ", "ორმოცდახუთი ",
                "ორმოცდაექვსი ", "ორმოცდაშვიდი ", "ორმოცდარვა ",
                "ორმოცდაცხრა ", "ორმოცდაათი ","ორმოცდათერთმეტი ",
                "ორმოცდათორმეტი ", "ორმოცდაცამეტი ", "ორმოცდათოთხმეტი ",
                "ორმოცდათხუთმეტი ", "ორმოცდათექვსმეტი ", "ორმოცდაჩვიდმეტი ",
                "ორმოცდათვრამეტი ", "ორმოცდაცხრამეტი ", "სამოცი ",
                "სამოცდაერთი ", "სამოცდაორი ",
                "სამოცდასამი ", "სამოცდაოთხი ", "სამოცდახუთი ",
                "სამოცდაექვსი ", "სამოცდაშვიდი ", "სამოცდარვა ",
                "სამოცდაცხრა ", "სამოცდაათი ","სამოცდათერთმეტი ",
                "სამოცდათორმეტი ", "სამოცდაცამეტი ", "სამოცდათოთხმეტი ",
                "სამოცდათხუთმეტი ", "სამოცდათექვსმეტი ", "სამოცდაჩვიდმეტი ",
                "სამოცდათვრამეტი ", "სამოცდაცხრამეტი ", "ოთხმოცი ",
                "ოთხმოცდაერთი ", "ოთხმოცდაორი ",
                "ოთხმოცდასამი ", "ოთხმოცდაოთხი ", "ოთხმოცდახუთი ",
                "ოთხმოცდაექვსი ", "ოთხმოცდაშვიდი ", "ოთხმოცდარვა ",
                "ოთხმოცდაცხრა ", "ოთხმოცდაათი ","ოთხმოცდათერთმეტი ",
                "ოთხმოცდათორმეტი ", "ოთხმოცდაცამეტი ", "ოთხმოცდათოთხმეტი ",
                "ოთხმოცდათხუთმეტი ", "ოთხმოცდათექვსმეტი ", "ოთხმოცდაჩვიდმეტი ",
                "ოთხმოცდათვრამეტი ", "ოთხმოცდაცხრამეტი "};

        String[] from_100_to_1000 = {"","ასი","ორასი", "სამასი", "ოთხასი",
                "ხუთასი", "ექვსასი", "შვიდასი",
                "რვაასი", "ცხრაასი","ათასი"};

        String[] from_100th_to_1000th = {"","ას ","ორას ", "სამას ", "ოთხას ",
                "ხუთას ", "ექვსას ", "შვიდას ",
                "რვაას ", "ცხრაას "};


        if (number < 0) {
            return "მინუს " + numberToSentence(-number);
        }
        if (number < 100) {
            return from_1_to_100[number];
        }
        if (number <= 1000) {
            if (number % 100 == 0) {
                return from_100_to_1000[number / 100];
            }else {
                return from_100th_to_1000th[number / 100] + from_1_to_100[number % 100];
            }
        }

        if (number < 1_000_000) {
            if (number % 1000 == 0) {
                return numberToSentence(number / 1000) + "12ათასი";
            } else {
                return numberToSentence(number / 1000) + "ათას " + numberToSentence(number % 1000);
            }
        }

        if (number == 1_000_000) {
            return "მილიონი";
        }
        return "";
    }
}

